package noute;

import java.io.Serializable;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;

public class Models implements Serializable {
    private List<HashMap<String, String>> listmodels = new ArrayList<>();

    public Models() {
        HashMap<String, String> m1 = new HashMap<>();
        m1.put("title", " Lenovo 110-15 (80TR000GRK)");
        m1.put("imgtitle", "https://www.notebook-center.ru/image/catalog_new/small/small_lenovo_11015_80tr000grk.jpg");
        m1.put("text", "Оформление пластикового корпуса ноутбука построено на комбинации черного и серого цветов. " +
                "Первый использован в области днища и частично в дисплейной части, а второй приятно оттеняет крышку и " +
                "рабочую поверхность изнутри. Это, плюс матовая поверхность, а также абсолютная сдержанность в плане " +
                "дизайнерских элементов, формирует образ максимально рабочей машинки, которая отлично впишется в " +
                "интерьер офисного стола. Lenovo V340 собран достаточно качественно – несмотря на не самый прочный пластик, детали подогнаны отлично, компоновка плотная и люфтов нет. Кроме того, сам лэптоп можно открыть одной рукой вплоть до 180 градусов. Правда, в нашем случае такому режиму использования вряд ли найдется применение, так как TN-дисплей не предполагает широкие углы обзора. А вот если приобретать более дорогую комплектацию с IPS-панелью, то, возможно, и найдется применение 180-градусной трансформации.\n" +
                "\n" +
                "Габариты лэптопа при весе 2.8 кг составляют 413х284.6х24.3 мм, что является среднестатистическим показателем на рынке среди крупных моделей ноутбуков. Производительность\n" +
                "\n" +
                "Lenovo V340-17IWL поставляется с полноценной операционной системой – Windows 10 Home, и работает с двухъядерным процессором Intel Pentium Gold 5405U с частотой 2300 МГц и 2 МБ кэша третьего уровня. Здесь есть поддержка технологии гиперпоточности, но нет разгона процессорных ядер. Это ULV-чип с энергопотреблением в 15 Вт, который обладает весьма умеренной производительностью, пригодной для решения ежедневных задач и офисных приложений.\n" +
                "\n" +
                "Встроенная видеокарта Intel HD Graphics 610 так же ограничена по мощности, как и процессор, ибо работает всего с 12 юнитами на частоте до 950 МГц. Ускоритель изготовлен по нормам 14-нм техпроцесса и поддерживает DirectX 12_1.\n" +
                "\n" +
                "Объем оперативной памяти стандарта DDR4-2133 МГц составляет 4 ГБ из 8 ГБ максимальных, и он распаян на плате. Контент пользователя производитель предлагает хранить на 1000 ГБ жесткого диска с частотой вращения шпинделя 5400 об/мин. ");
        m1.put("textsmall", "Если вам нужен ноутбук, адекватно соответствующий ресурсами своей цене, то Lenovo V340" +
                " – отличный вариант. Он стоит менее $500 и оснащен всем необходимым, чтобы пользователь мог успешно " +
                "справиться с каждодневными задачами.");
        m1.put("img1", "https://www.notebook-center.ru/image/catalog_new/lenovo_11015_80tr000grk_1.jpg");
        m1.put("img2", "https://www.notebook-center.ru/image/catalog_new/lenovo_11015_80tr000grk_2.jpg");
        m1.put("img3", "https://www.notebook-center.ru/image/catalog_new/lenovo_11015_80tr000grk_3.jpg");
        listmodels.add(m1);
        //
        HashMap<String, String> m2 = new HashMap<>();
        m2.put("title", "Lenovo IdeaPad S540-13 — увлекательные перспективы");
        m2.put("imgtitle", "https://www.notebook-center.ru/image/upload/overview/small_lenovo_ideapad_s54013.jpg");
        m2.put("text", "Влинейке IdeaPad пополнение — 13.3-дюймовый ноутбук Lenovo IdeaPad S540-13. Компания Lenovo " +
                "остается верной себе: новинка заключена в алюминиевый корпус модной расцветки, оснащается ярким экраном," +
                " фирменной удобной клавиатурой с подсветкой, ИК-камерой, аккумулятором, который долго держит заряд. " +
                "Самая дорогая модификация обойдется примерно в $1000, при этом она комплектуется чипом десятого поколения, " +
                "16 ГБ оперативной памяти и емким хранилищем. На первый взгляд кажется, что устройство идеально подходит " +
                "для частых поездок и постоянных перемещений в офисе или где-либо еще. Так ли это? Проверим. Ноутбук доступен в трех цветовых вариациях: «морозный белый», «голубой лед» и «платиновый серый». Корпус сделан из металла, что говорит о его долговечности и износостойкости. Все панели матовые (кроме дисплея) и устойчивые к отпечаткам пальцев. На крышке — небольшой аккуратный логотип, точно такой же находится на рабочей зоне. В целом, внешний вид устройства строгий, но не вычурный, хорошо смотрится дома, в офисе, на собрании и в любой другой обстановке. Экран окружают тонкие рамки, причем верхняя и нижняя незначительно толще боковых, так что все выглядит гармонично. Клавиатура оснащается кнопками с фирменным закругленным низом; нампада нет. Шарнирный механизм представлен продолговатой петлей, в меру податливой. Максимальный угол раскрытия дисплея составляет около 140 градусов. Ноутбук можно проапгрейдить, для этого нужно раскрутить винтики на днище. После этой манипуляции пользователь получает доступ к SSD-накопителю, вентилятору и модулю Wi-Fi. К сожалению, ОЗУ распаяна на плате, поэтому увеличить ее невозможно. Что касается габаритов — девайс получился компактным и мобильным. Его размеры — 308х211х15 мм, а вес равен 1.27 кг. ");
        m2.put("textsmall", "У этого 13.3-дюймового устройства отличные результаты автономности, яркий экран, клавиатура " +
                "с подсветкой и современная начинка. Кроме того, ноутбук оснащается ИК-камерой для защиты от посторонних," +
                " а также хорошим запасом ОЗУ и емким хранилищем. " +
                "Lenovo IdeaPad S540-13IML (81XA002MRU) поставляется на базе 64-битной ОС Windows 10 Home. Четырехъядерный процессор Intel Core i5-10210U поколения Comet Lake работает на частоте 1.6-4.2 ГГц (если активны все ядра, то максимум — 3.9 ГГц). Он поддерживает HyperThreading, поэтому одновременно обрабатывает восемь потоков данных. Чип все еще выполнен по нормам 14-нм техпроцесса, его тепловой пакет равен 15 Вт, а кэш третьего уровня составляет 6 МБ.\n" +
                "\n" +
                "Встроенная видеокарта Intel UHD Graphics 620 разгоняется в пределах 300-1100 МГц. Она отлично подойдет для веб-серфинга, просмотра потокового видео, работы с таблицами, документами, словом, со всем, что нужно для повседневной работы, без использования профессиональных приложений. Можно и поиграть, но только в казуальные игры, на средних или минимальных настройках.\n" +
                "\n" +
                "Объем оперативной памяти лэптопа равен 16 ГБ стандарта DDR4-2400 МГц. Для хранения данных выделено 512 ГБ на SSD-диске. ");
        m2.put("img1", "https://www.notebook-center.ru/image/upload/overview/lenovo_ideapad_s54013_1.jpg");
        m2.put("img2", "https://www.notebook-center.ru/image/upload/overview/lenovo_ideapad_s54013_2.jpg");
        m2.put("img3", "https://www.notebook-center.ru/image/upload/overview/lenovo_ideapad_s54013_3.jpg");
        listmodels.add(m2);
        //
        HashMap<String, String> m3 = new HashMap<>();
        m3.put("title", "Lenovo ThinkPad X1 Yoga (5th Gen) — недостатки не найдены");
        m3.put("imgtitle", "https://www.notebook-center.ru/image/upload/overview/small_lenovo_thinkpad_x1_yoga_5th_gen.jpg");
        m3.put("text", "Вэтом году вышла новая модель Lenovo ThinkPad X1 Yoga уже пятого поколения. Как и у предшественников, фишка этого устройства — возможность использовать его как ноутбук, планшет или же выбрать промежуточный режим. По сравнению с предыдущим поколением, новинка стала мощнее за счет процессоров 10-го поколения, также изменились стандарты оперативной памяти и модуля Wi-Fi. Как и прежде, девайс оснащается 14-дюймовым матовым экраном и удобной клавиатурой, отличным запасом ОЗУ на борту и емким накопителем SSD. Стоимость устройства в описываемой комплектации составляет около $2200.\n" +
                "Ноутбук заключен в алюминиевый корпус, который легко выдерживает частые транспортировки в рюкзаке или сумке. Цвет — нейтральный серый (Iron Gray), скучноватый на наш взгляд, но тем не менее у подобных однотонных оттенков много поклонников. Небольшая яркая деталь — черно-красный логотип на крышке, красные кайма тачпада и трекпоинт. Все панели корпуса матовые, хорошо противостоят отпечаткам пальцев. " +
                "Шарнирный механизм — в виде двух небольших петель. Они позволяют поворачивать экран на 360 градусов, по факту, превращать его в планшет. Кроме того, доступны промежуточные режимы, удобные для игр, просмотров слайд-шоу, презентаций. Дисплей выглядит современно, тонкие рамки создают ощущение простора. На верхней — глазок веб-камеры, под экраном расположен небольшой логотип компании. Клавиатура выглядит стандартно для Lenovo: закругленный, в виде улыбки, низ клавиш, стандартная раскладка. " +
                "Качество сборки устройства отличное: подложка клавиатуры и крышка не прогибаются, при смене режимов не появляется хруст или другие посторонние звуки. Ноутбук получился мобильным: его вес составляет 1.35 кг, а размеры — 323х218х15.2 мм. " +
                "Lenovo ThinkPad X1 Yoga G5 T (20UB002WRT) поставляется с операционной системой Windows 10 Pro 64-bit. Для этой комплектации используется четырехъядерный процессор Intel Core i7-10510U поколения Comet Lake. Он работает на частоте 1.8-4.9 ГГц, обрабатывает одновременно восемь потоков данных. Чип изготовлен по улучшенному 14-нм техпроцессу, имеет 8 МБ кэша третьего уровня и потребляет до 15 Вт.\n" +
                "\n" +
                "Встроенная видеокарта Intel UHD Graphics 620 отлично справляется с таблицами, документами, веб-серфингом, потоковым видео, с простенькими графическими редакторами. Таким образом, для неспецифических задач эта начинка очень даже подходит. На ноутбуке можно даже поиграть, правда, запустить получится несложные казуальные игры, например, Dota 2, CS:GO и т. п.\n" +
                "\n" +
                "Запас оперативной памяти составляет 16 ГБ стандарта LPDDR3-2133. Слот припаян к материнской плате, поэтому замене не подлежит. Что касается хранения данных, для этого есть SSD емкостью 1 ТБ. ");
        m3.put("textsmall", "В этом 14-дюймовом ноутбуке-трансформере прекрасно все: матовый экран, современная начинка, влагозащищенная клавиатура, набор современных интерфейсов и емкий аккумулятор. Единственное, что смущает — ценник, который колеблется в районе $2200.");
        m3.put("img1", "https://www.notebook-center.ru/image/upload/overview/lenovo_thinkpad_x1_yoga_5th_gen_1.jpg");
        m3.put("img2", "https://www.notebook-center.ru/image/upload/overview/lenovo_thinkpad_x1_yoga_5th_gen_7.jpg");
        m3.put("img3", "https://www.notebook-center.ru/image/upload/overview/lenovo_thinkpad_x1_yoga_5th_gen_3.jpg");
        listmodels.add(m3);
        //
        HashMap<String, String> m4 = new HashMap<>();
        m4.put("title", "Lenovo ThinkPad X13: в списке достойных");
        m4.put("imgtitle", "https://www.notebook-center.ru/image/upload/overview/small_lenovo_thinkpad_x13.jpg");
        m4.put("text", "Линейка ThinkPad уже давно нашла своего покупателя – бизнесмена, работника корпорации, того, кто готов доверить девайсу важную конфиденциальную информацию. Несмотря на успешность производитель все равно продолжает работать над усовершенствованием модельного ряда, чтобы тот оставался конкурентоспособным и востребованным. В частности, ноутбук Lenovo ThinkPad X13 компания выпустила в различных конфигурациях, предоставив пользователям возможность выбрать как в плане производительности, так и бюджета. Лэптоп в комплектации ThinkPad X13 (20T2003LRT) отнюдь не дешевый, его ценник достигает $2000. Впрочем, и достоинства девайса налицо: поддержка 4G LTE, мощный четырехъядерный процессор Intel Core i7-10510U, 13-дюймовый сенсорный дисплей, а также клавиатура с подсветкой и сканер отпечатка пальца. По-видимому, устройство будет готово к любым испытаниям, причем не только в рабочей среде. " +
                "Корпус ноутбука изготовлен на основе сплава магния и алюминия, хотя для некоторых панелей использован и пластик. Конструкция Lenovo ThinkPad X13 получилась крепкой, она прошла серьезные испытания – тесты по военным стандартам. В результате устройство можно спокойно брать с собой повсюду, работать с ним в экстремальных условиях перепада температур, во время пылевой бури. Также ноутбуку не страшны вибрации или дождь. Кстати, лэптоп 13-дюймового формата довольно мобильный. При габаритах 312х217х17 мм и весе 1.29 кг он станет помощником в любой поездке, а не только в рабочем кабинете. " +
                "Оформлен девайс типично для бизнес-модели. Здесь использован строгий черный цвет, который лишь слегка разбавляют красные акценты: TrackPoint, тонкие линии, отделяющие кнопки в зоне тачпада. Естественно, не забыто и название ThinkPad с яркой точкой над «i». Все панели ноутбука сделаны матовыми, смотрятся они солидно. Такой дизайн будет выигрышным в любой обстановке. Что касается сборки лэптопа, то к ней нет вопросов. Стыковка деталей конструкции выполнена без зазоров; нет скрипов, люфта, деформации при нажатии. Вдобавок очень удобно использовать ноутбук благодаря раскрытию до 180 градусов. Это обеспечивают две петли, надежно удерживающие крышку в заданном положении.\n" +
                "Lenovo ThinkPad X13 (20T2003LRT) поставляется с 64-битной Windows 10 Professional. Железо ноутбука обеспечивает хорошую производительность. В частности, с ежедневными рабочими задачами успешно справляется низковольтный процессор Intel Core i7-10510U, построенный по 14-нм технологии. Он обладает четырьмя ядрами и кэш-памятью третьего уровня 8 МБ. В ходе вычислений чип использует тактовую частоту от 1800 до 4900 МГц, а также возможность обрабатывать до восьми потоков информации в параллельном режиме. Важно отметить, что некоторые другие модификации ThinkPad X13 могут поставляться не с Intel, а с AMD-комплектующими. " +
                "Процессор поддерживает память DDR4 с частотой шины 2666 МГц. Всего в данной конфигурации предусмотрено 16 ГБ ОЗУ, что обеспечивает ноутбуку необходимую многозадачность. Что касается обработки графики, то подобными вычислениями занимается встроенная видеокарта Intel UHD Graphics 620, использующая всего 24 исполнительных блока. Ускоритель умеет декодировать видео HEVC H.265 Main10, а также запускать простые нетребовательные игры. Для повседневных бизнес-задач возможностей данной видеокарты достаточно.\n" +
                "\n" +
                "В корпусе лэптопа установлен быстрый и надежный SSD, имеющий объем 256 ГБ. По современным меркам – не слишком много, хотя под хранение документации – подойдет. Если необходим накопитель большей емкости, можно присмотреться к другим конфигурациям.\n" +
                "Данный ноутбук станет хорошим проводником в мире бизнеса. Корпус девайса надежный и практичный, прошедший испытания по военным стандартам, а меры защиты – подходящие и проверенные. Также Lenovo ThinkPad X13 порадует 13-дюймовым сенсорным дисплеем со стабильной обзорностью и хорошей цветопередачей, производительными компонентами, подсветкой клавиш, подходящими портами и поддержкой Wi-Fi 6 и 4G. Вдобавок устройство наделено батареей, которая обеспечивает продолжительную работу. Важно, что достаточное количество выпущенных конфигураций поможет владельцу выбрать модель по своему бюджету. ");
        m4.put("textsmall", "Ультрапортативный девайс Lenovo ThinkPad X13 обладает хорошими производительностью и автономностью, а также располагает массой достоинств, с помощью которых будет конкурентоспособным. В ноутбуке предусмотрены: подсветка клавиш, сенсорный дисплей, поддержка 4G LTE, Fingerprint и слот для смарт-карт.");
        m4.put("img1", "https://www.notebook-center.ru/image/upload/overview/lenovo_thinkpad_x13_2.jpg");
        m4.put("img2", "https://www.notebook-center.ru/image/upload/overview/lenovo_thinkpad_x13_5.jpg");
        m4.put("img3", "https://www.notebook-center.ru/image/upload/overview/lenovo_thinkpad_x13_3.jpg");
        listmodels.add(m4);
        //
        HashMap<String, String> m5 = new HashMap<>();
        m5.put("title", "Lenovo ThinkBook Plus — двойные возможности");
        m5.put("imgtitle", "https://www.notebook-center.ru/image/upload/overview/small_lenovo_thinkbook_plus_7.jpg");
        m5.put("text", "Ряды бизнес-ноутбуков пополнились одной необычной моделью — 13.3-дюймовым Lenovo ThinkBook Plus. Новинка интересна, прежде всего, наличием дополнительного экрана E Ink, расположенного на крышке корпуса. Характеристики ноутбука также располагают к покупке: здесь используется процессор 10-го поколения, Full HD дисплей (основной), крепкие материалы корпуса, удобная клавиатура и современные функции безопасности. Стоимость устройства варьируется от $1000 до $1300, в зависимости от выбранного процессора и объема оперативной памяти. " +
                "Ноутбук доступен в одном цвете — темно-сером (Iron Grey), подходящем для любого места и любой ситуации. Корпус из анодированного алюминия, крепкий и в то же время легкий, подходящий для частых поездок. Качество сборки отличное, нет хрустов, прогибов, люфтов. Lenovo ThinkBook Plus выдерживает сильные перепады температур и вибрации, также случайно пролитая жидкость (до четверти стакана) не приведет к печальным последствиям. Все панели корпуса матовые, неплохо противостоят отпечаткам пальцев. Однако пыль и мелкие соринки на поверхностях хорошо заметны, к счастью, они легко удаляются. " +
                "13.3-дюймовый экран окружают тонкие боковые рамки, чуть потолще — верхняя и, наконец, ощутимо широкая — нижняя. Боковые панели корпуса магнитные, к любой можно крепить стилус (в комплекте поставки). Клавиатура выглядит стандартно для ноутбуков Lenovo, с закругленными нижними уголками. Шарнир, соединяющий верх и низ конструкции, выполнен из цинкового сплава и крепко удерживает экран в нужном ракурсе. Максимальный угол раскрытия составляет 180 градусов, так что дисплей можно положить на столе. " +
                "Крышка ноутбука и не крышка вовсе — практически всю ее площадь занимает дополнительный экран. Он, в свою очередь, окружен довольно толстыми рамками, которые существенно съедают полезное пространство. По задумке производителя экран удобнее использовать в вертикальной ориентации. По левую сторону от него — крупный логотип линейки, а сверху — небольшая надпись Lenovo. Напоследок упомянем о мобильности устройства: размеры составляют 308х217х17.4 мм, вес равен 1.4 кг. " +
                "Lenovo ThinkBook Plus (IML 20TG006ERU) работает на базе операционной системы Windows 10 Pro 64-bit. В данной комплектации используется четырехъядерный чип Intel Core i5-10210U поколения Comet Lake. Он работает на частоте 1.6-4.2 ГГц, поддерживает технологию многопоточности, за счет чего обрабатывает одновременно до восьми потоков данных. Процессор сделан по 14-нм техпроцессу, кэш третьего уровня составляет 6 МБ, а TDP равен 15 Вт.\n" +
                "\n" +
                "Встроенная видеокарта Intel UHD Graphics 620 разгоняется с 300 до 1100 МГц. Не стоит ждать от нее чудес: графика хорошо справляется с повседневными офисными задачами, но современные игры и другие требовательные приложения она не потянет.\n" +
                "\n" +
                "Объем оперативной памяти составляет 16 ГБ стандарта DDR4-2666 МГц. Хранить медиаконтент производитель предлагает на быстром SSD-накопителе емкостью 512 ГБ. Раз уж речь зашла о данных: в ноутбуке задействован модуль dTPM 2.0, который шифрует информацию с лэптопа для ее безопасного хранения. ");
        m5.put("textsmall", "Особенность этого 13.3-дюймового ноутбука — наличие дополнительного экрана, монохромного, с сенсорным управлением. На этом хорошее не заканчивается: лэптоп поставляется с современной начинкой, матовым Full HD-экраном и продуманным набором интерфейсов. ");
        m5.put("img1", "https://www.notebook-center.ru/image/upload/overview/lenovo_thinkbook_plus.jpg");
        m5.put("img2", "https://www.notebook-center.ru/image/upload/overview/lenovo_thinkbook_plus_1.jpg");
        m5.put("img3", "https://www.notebook-center.ru/image/upload/overview/lenovo_thinkbook_plus_2.jpg");
        listmodels.add(m5);
        //

    }

    public List<HashMap<String, String>> getListmodels() {
        return listmodels;
    }

    public void setListmodels(List<HashMap<String, String>> listmodels) {
        this.listmodels = listmodels;
    }
}
